#include<iostream>

/*
Создать систему запросов «Сайт → Магазины (3 штуки) → Склад». 
Товар, который интересует клиента – путеводители по разным городам и странам, 
которые имеют ряд характеристик: название, издательство, год, число страниц, наличие фотографий, наличие карты, переплет, формат, автор, количество.
Пользователь использует сайт для нахождения интересующего товара, затем запрос отправляется в магазины, затем на склад. Использовать паттерн «Цепочка обязанностей». 
Данные о товаре для сайта, магазинов и склада берутся из внешних входных файлов «site», «shop1», «shop2» , «shop3» и «warehouse» соответственно.
*/
using namespace std;
int main(void)
{
	setlocale(LC_ALL, "rus");


	cin.get(); cin.get();
	return 0;
}
